# Application Shared Components Location Property

Source: https://www.revitapidocs.com/2026/b573da88-d39e-d2a3-1775-7303d1c9742f.htm

---

| Application Shared Components Location Property |
| --- |

Location of shared components used by Revit.
**Namespace:** Autodesk.Revit.ApplicationServices
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string SharedComponentsLocation { get; }
```

```
Public ReadOnly Property SharedComponentsLocation As String
	Get
```

```
public:
property String^ SharedComponentsLocation {
	String^ get ();
}
```

```
member SharedComponentsLocation : string with get
```

#### Property Value

String See Also

#### Reference

Application Class Autodesk.Revit.ApplicationServices Namespace